In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'A':[1,2,3],'B':[4,np.nan,np.nan],'C':[5,np.nan,6]})

In [5]:
df

   A    B    C
0  1  4.0  5.0
1  2  NaN  NaN
2  3  NaN  6.0

In [7]:
df.dropna()

   A    B    C
0  1  4.0  5.0

In [9]:
df

   A    B    C
0  1  4.0  5.0
1  2  NaN  NaN
2  3  NaN  6.0

In [11]:
df.dropna(axis=1)

   A
0  1
1  2
2  3

In [19]:
df.dropna(thresh=2)

   A    B    C
0  1  4.0  5.0
2  3  NaN  6.0

In [21]:
df.fillna(value='Fill')

   A     B     C
0  1   4.0   5.0
1  2  Fill  Fill
2  3  Fill   6.0

In [25]:
df

   A    B    C
0  1  4.0  5.0
1  2  NaN  NaN
2  3  NaN  6.0

In [27]:
df['B']

0    4.0
1    NaN
2    NaN
Name: B, dtype: float64

In [33]:
df['C'].fillna(value=df['B'].mean())

0    5.0
1    4.0
2    6.0
Name: C, dtype: float64